[
    {
        "url": "https://www.youtube.com/watch?v=mVKAyw0xqxw&t=6s",
        "transcript": "It Tails OS, a free based AF operating system designed to protect you against malware, censorship and surveillance. It was first released in 2009 and became famous when Edward Snowden used it to communicate with reporters, exposing the government's mass surveillance programs. Most personal computers are just cool prisons that track your every movement and harvest your biometric data so advertisers can eventually unburden you from your money. Tails OS is a debian Linux distro that boots from a USB stick to turn any computer into a temporarily secure machine. When you finally discover the true shape of the Earth, you might think you're clever because you used a private browser and deleted all the files from your computer, but traces were left behind on disk that can be recovered via forensic analysis. And now they're going to try to unalive you. Tails helps you avoid this fate. Thanks to amnesia, everything you do disappears automatically when the OS shuts down, because Tails never writes anything to the hard disk and only runs from the memory on your computer. When you get a knock at the door, there's no need to rip out your hard drive and flush it down the toilet. Instead, just turn the computer off and all the totally legit and mundane things you just did will be lost forever. However, it is possible to store some information on the USB, like browser BOOKMARKS or documents that you want to persist between sessions. And of course, they're encrypted automatically when you boot it up. You'll find your favorite Ganu utilities, but also privacy focused software like the Tor browser, which routes Internet traffic through the Tor network, consisting of multiple layers of encrypted relays where no individual relay knows both where you're coming from and where you're going to conceal your location, IP address and usage. In fact, any application that tries to access the Internet without the Tor network is automatically blocked on Tails. This makes it a great option for journalists working on sensitive topics, victims of domestic abuse, or anyone who enjoys truly free software. Where free means freedom. What will you do without freedom? To get started, grab a USB stick with at least 8GB of memory, then download the version that matches your current OS. Now verify the file to ensure that it wasn't corrupted during download. Then use a tool like etcher to safely flash it on the USB stick. Next, make sure you have the official startup instructions on a separate device. Then on Windows, hold down the Shift key while clicking on the restart button from the Start menu. Then use the option to reboot from a device. This will bring up a boot menu where you can select the USB stick, at which point you can select Tails from the bootloader. And now we're officially running Tails. Go through the initial setup and most importantly, make sure you have a good connection to the Tor network. Congratulations, you now have a private and anonymous computer. Everything you do now is stored in random access memory and not on disk. In addition, when Tails shuts down, it will overwrite most of the Ram to prevent a cold boot attack where someone extracts memory dump from the Ram, which is often done in digital forensics to catch the bad guys. This has been Tails OS in 100 seconds, but don't tell anybody I told you about it. Thanks for watching and I will see you in the next one."
    }
]