{
    "introduction": "Tails OS, a free based AF operating system designed to protect you against malware, censorship, and surveillance. It was first released in 2009 and became famous when Edward Snowden used it to communicate with reporters, exposing the government's mass surveillance programs. Tails OS is a debian Linux distro that boots from a USB stick to turn any computer into a temporarily secure machine.",
    "explanation": "Tails OS is a debian Linux distro that boots from a USB stick to turn any computer into a temporarily secure machine. Tails helps you avoid this fate. Thanks to amnesia, everything you do disappears automatically when the OS shuts down, because Tails never writes anything to the hard disk and only runs from the memory on your computer. Just turn the computer off and all the totally legit and mundane things you just did will be lost forever.",
    "storing information": "However, it is possible to store some information on the USB, like browser BOOKMARKS or documents that you want to persist between sessions. And of course, they're encrypted automatically when you boot it up. You'll find your favourite Ganu utilities, but also privacy focused software like the Tor browser, which routes Internet traffic through the Tor network, consisting of multiple layers of encrypted relays where no individual relay knows both where you're coming from and where you're going to conceal your location, IP address and usage. In fact, any application that tries to access the Internet without the Tor network is automatically blocked on Tails.",
    "installation": "To get started, grab a USB stick with at least 8GB of memory, then download the version that matches your current OS. Now verify the file to ensure that it wasn't corrupted during download. Then use a tool like etcher to safely flash it on the USB stick. Next, make sure you have the official startup instructions on a separate device. Then on Windows, hold down the Shift key while clicking on the restart button from the Start menu. Then use the option to reboot from a device. This will bring up a boot menu where you can select the USB stick, at which point you can select Tails from the bootloader. And now we're officially running Tails."
}